In [3]:
# Importing libraries
import pandas as pd
import numpy as np

### 1. Write script to answer following 
Dataset - http://bit.ly/smallstocks

In [3]:
# Load dataset
df = pd.read_csv(r'http://bit.ly/smallstocks')
df.head(10)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

#### Set index on ‘Symbol‘ and 'Date‘, allow inplace changes

In [4]:
df.set_index(['Symbol','Date'], inplace = True)
df

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

#### Sort indexes

In [5]:
df = df.groupby(['Symbol','Date']).first()
df

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

#### Select data for “AAPL”

In [6]:
df.loc[(('AAPL', ), ), ]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100

#### Select “Close” value for “AAPL” on “2016-10-03”

In [7]:
df.loc[('AAPL', '2016-10-03'), 'Close']

112.52

#### Select data for Apple and Microsoft

In [8]:
df.loc[(('AAPL', 'MSFT'),),]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

#### Select data for Apple and Microsoft for a particular Date

In [9]:
df.loc[(('AAPL', 'MSFT'),('2016-10-03')),]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

#### Select data for apple on multiple dates

In [10]:
df.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

#### Selecting all data for '2016-10-03', '2016-10-04' date

In [11]:
df.loc[(slice(None),('2016-10-03', '2016-10-04')),]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900

### 2. Grouping and Aggregations 

Dataset - https://raw.githubusercontent.com/datagy/data/main/sales.csv

#### Load data and group by Region

In [4]:
data = pd.read_csv(r'https://raw.githubusercontent.com/datagy/data/main/sales.csv')
data

           date  gender      region  sales
0     8/22/2022    Male  North-West  20381
1      3/5/2022    Male  North-East  14495
2      2/9/2022    Male  North-East  13510
3     6/22/2022    Male  North-East  15983
4     8/10/2022  Female  North-West  15007
..          ...     ...         ...    ...
995    6/2/2022  Female  North-West  14015
996   5/20/2022  Female  North-East  15503
997    4/2/2022    Male  North-East  18714
998   12/7/2022    Male  North-East  19910
999  12/19/2022  Female  North-West  16589

[1000 rows x 4 columns]

In [5]:
data.groupby(['region'])

#### Counting number of groups

In [6]:
len(data.groupby(['region']))

3

#### Accessing the Groups in a GroupBy object

In [7]:
(data.groupby(['region'])).groups

{'North-East': [1, 2, 3, 12, 13, 14, 15, 18, 19, 23, 24, 25, 26, 28, 31, 35, 40, 41, 45, 50, 51, 58, 59, 60, 63, 64, 67, 68, 72, 75, 76, 77, 80, 82, 83, 85, 87, 92, 94, 100, 105, 108, 109, 112, 113, 114, 115, 120, 121, 125, 127, 130, 134, 138, 139, 140, 141, 142, 146, 149, 155, 157, 164, 165, 176, 177, 179, 180, 188, 191, 193, 195, 199, 201, 205, 207, 211, 216, 218, 222, 224, 228, 231, 236, 242, 243, 246, 249, 254, 256, 259, 264, 265, 271, 272, 280, 283, 287, 288, 289, ...], 'North-West': [0, 4, 7, 11, 16, 17, 21, 29, 30, 34, 36, 38, 39, 42, 43, 44, 46, 48, 49, 52, 55, 56, 62, 66, 70, 71, 74, 79, 88, 89, 90, 91, 95, 98, 99, 103, 106, 116, 117, 119, 122, 123, 128, 129, 132, 137, 143, 144, 147, 148, 151, 153, 154, 156, 160, 161, 169, 171, 175, 178, 184, 185, 186, 198, 204, 206, 209, 212, 217, 221, 223, 225, 230, 233, 234, 235, 237, 240, 244, 251, 252, 253, 255, 260, 261, 263, 266, 267, 277, 278, 281, 285, 290, 291, 296, 297, 300, 318, 320, 321, ...], 'South': [5, 6, 8, 9, 10, 20, 22, 27, 32, 33, 37, 47, 53, 54, 57, 61, 65, 69, 73, 78, 81, 84, 86, 93, 96, 97, 101, 102, 104, 107, 110, 111, 118, 124, 126, 131, 133, 135, 136, 145, 150, 152, 158, 159, 162, 163, 166, 167, 168, 170, 172, 173, 174, 181, 182, 183, 187, 189, 190, 192, 194, 196, 197, 200, 202, 203, 208, 210, 213, 214, 215, 219, 220, 226, 227, 229, 232, 238, 239, 241, 245, 247, 248, 250, 257, 258, 262, 268, 269, 270, 273, 274, 275, 276, 279, 282, 284, 286, 292, 294, ...]}

#### Accessing only Group Names of a GroupBy Object

In [8]:
(data.groupby('region')).groups.keys()

dict_keys(['North-East', 'North-West', 'South'])

#### Selecting a Group of south region

In [9]:
data[data['region'] == 'South']

           date  gender region  sales
5      9/6/2022    Male  South  21792
6     8/21/2022    Male  South  20113
8    11/22/2022    Male  South  14594
9     1/16/2022  Female  South  24114
10   12/21/2022    Male  South  35154
..          ...     ...    ...    ...
972    6/9/2022    Male  South  22254
979  11/24/2022  Female  South  25591
981   12/5/2022    Male  South  34334
985   12/1/2022  Female  South  21282
994   9/29/2022    Male  South  21255

[331 rows x 4 columns]

#### Findout average sales per region

In [10]:
avg_sale = data.groupby(['region'])['sales'].mean()
avg_sale

region
North-East    17386.072046
North-West    15257.732919
South         24466.864048
Name: sales, dtype: float64

#### Applying Multiple Aggregations Using Pandas GroupBy - Find out Mean, median and variance of sales per region

In [11]:
data.groupby('region')['sales'].aggregate(['mean', 'median', 'var'])

                    mean   median           var
region
North-East  17386.072046  17414.0  4.131225e+06
North-West  15257.732919  15337.5  1.311495e+07
South       24466.864048  24492.0  2.760139e+07

#### Calculate percentage of region's sales per row with respect to total sale of the region

In [12]:
data['sales_per'] = (data['sales']/data['sales'].sum())*100
data

           date  gender      region  sales  sales_per
0     8/22/2022    Male  North-West  20381   0.107018
1      3/5/2022    Male  North-East  14495   0.076111
2      2/9/2022    Male  North-East  13510   0.070939
3     6/22/2022    Male  North-East  15983   0.083925
4     8/10/2022  Female  North-West  15007   0.078800
..          ...     ...         ...    ...        ...
995    6/2/2022  Female  North-West  14015   0.073591
996   5/20/2022  Female  North-East  15503   0.081404
997    4/2/2022    Male  North-East  18714   0.098265
998   12/7/2022    Male  North-East  19910   0.104545
999  12/19/2022  Female  North-West  16589   0.087107

[1000 rows x 5 columns]

#### Filtering Rows Where the Group's Average Sale Price is Less Than 20,000

In [14]:
fil = avg_sale[avg_sale < 20000]
filtered = data[data['region'].isin(fil.index)]
filtered

           date  gender      region  sales  sales_per
0     8/22/2022    Male  North-West  20381   0.107018
1      3/5/2022    Male  North-East  14495   0.076111
2      2/9/2022    Male  North-East  13510   0.070939
3     6/22/2022    Male  North-East  15983   0.083925
4     8/10/2022  Female  North-West  15007   0.078800
..          ...     ...         ...    ...        ...
995    6/2/2022  Female  North-West  14015   0.073591
996   5/20/2022  Female  North-East  15503   0.081404
997    4/2/2022    Male  North-East  18714   0.098265
998   12/7/2022    Male  North-East  19910   0.104545
999  12/19/2022  Female  North-West  16589   0.087107

[669 rows x 5 columns]

#### 10. Calculate the sum of all sales broken out by 'region' and by 'gender'

In [15]:
data.groupby(['region', 'gender'])['sales'].sum()

region      gender
North-East  Female    3051132
            Male      2981835
North-West  Female    2455899
            Male      2457091
South       Female    4135688
            Male      3962844
Name: sales, dtype: int64

#### 11. Ranking Sales by Region and by Gender

In [18]:
data['rank'] = data.groupby(['region', 'gender'])['sales'].rank(ascending = False)
data

           date  gender      region  sales  sales_per   rank
0     8/22/2022    Male  North-West  20381   0.107018   11.0
1      3/5/2022    Male  North-East  14495   0.076111  154.0
2      2/9/2022    Male  North-East  13510   0.070939  168.0
3     6/22/2022    Male  North-East  15983   0.083925  138.0
4     8/10/2022  Female  North-West  15007   0.078800   89.5
..          ...     ...         ...    ...        ...    ...
995    6/2/2022  Female  North-West  14015   0.073591  102.0
996   5/20/2022  Female  North-East  15503   0.081404  145.0
997    4/2/2022    Male  North-East  18714   0.098265   48.0
998   12/7/2022    Male  North-East  19910   0.104545   22.0
999  12/19/2022  Female  North-West  16589   0.087107   65.0

[1000 rows x 6 columns]